wallCondensationCoupled/testCases/simple/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // leftSolid
    {
        name    leftSolidCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-100 0 -100 )(-0.01001 0.00999 100);
        }
    }
    {
        name    leftSolid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set leftSolidCellSet;
        }
    }

    // rightSolid
    {
        name    rightSolidCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.01001 0 -100 )(100 0.00999 100);
        }
    }
    {
        name    rightSolid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set rightSolidCellSet;
        }
    }

    // air is all the other cells
    {
        name    airCellSet;
        type    cellSet;
        action  new;
        source  cellToCell;
        sourceInfo
        {
            set leftSolidCellSet;
        }
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  cellToCell;
        sourceInfo
        {
            set rightSolidCellSet;
        }
    }
    {
        name    airCellSet;
        type    cellSet;
        action  invert;
    }
    {
        name    air;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set airCellSet;
        }
    }
);


// ************************************************************************* //
